# St7SetProjectDirectionAsConical

Sets the mode of projection to Conical for subsequent uses of projection tools.

long St7SetProjectDirectionAsConical(long uID, double* Apex)
Input Parameters
uID
Strand7 model file ID.
Apex[0..2]
Apex of cone.